gingerologist/stm32-project-bundle/mx/tong-v3-g431kbu6/Core/Src/sidekick.c
/*
 * sidekick.c
 *
 *  Created on: 2026年6月2日
 *      Author: matia
 */
#include <string.h>
#include <stdint.h>
#include <stdbool.h>
#include <errno.h>
#include <stdio.h>
#include <assert.h>

#include "cmsis_os.h"
#include "FreeRTOS.h"
#include "stm32g4xx_hal.h"
#include "task.h"

#include "main.h"
#include "dac53202.h"
#include "embedded_cli.h"
#include "sidekick.h"

/**
 * current 8 bit
 * period  10 bit
 * width   9 bit
 */

pulse_config_t pulse_config[2] = {
    {.current = 0, .period = 0, .width = 0, .interval = 0},
    {.current = 0, .period = 0, .width = 0, .interval = 0}};

EmbeddedCliConfig *cli_config = NULL;
EmbeddedCli *cli              = NULL;

extern UART_HandleTypeDef huart1;
extern SPI_HandleTypeDef hspi1;
extern TIM_HandleTypeDef htim2;

extern QueueHandle_t configPendingQueueHandle;
extern QueueHandle_t configIdleQueueHandle;

int _write(int file, char *ptr, int len) {
  // Redirect stdout (file=1) and stderr (file=2) to UART2
  if (file == 1 || file == 2) {
    HAL_UART_Transmit(&huart1, (uint8_t *)ptr, len, HAL_MAX_DELAY);
    return len;
  }

  errno = EBADF;
  return -1;
}

static void cli_writeChar(EmbeddedCli *embeddedCli, char c) {
  uint8_t chr = c;
  HAL_UART_Transmit(&huart1, &chr, 1, HAL_MAX_DELAY);
}

/**
 * gemini advise to write to nop as nop
 */
uint8_t wnop[3] = {0x00, 0x00, 0x00};
uint8_t rnop[3] = {0x80, 0x00, 0x00};

void read_reg(regaddr_t addr, uint8_t data[2]) {
  uint8_t out[3] = {0x80 | addr, 0, 0};
  HAL_SPI_Transmit(&hspi1, out, 3, 10);
}

void SPI1_Set_CPOL_1(void) {
  while ((SPI1->SR & SPI_SR_FTLVL) || (SPI1->SR & SPI_SR_BSY))
    ;
  SPI1->CR1 &= ~SPI_CR1_SPE;
  SPI1->CR1 |= SPI_CR1_CPOL;
  SPI1->CR1 |= SPI_CR1_SPE;
}

void SPI1_Set_CPOL_0(void) {
  while ((SPI1->SR & SPI_SR_FTLVL) || (SPI1->SR & SPI_SR_BSY))
    ;
  SPI1->CR1 &= ~SPI_CR1_SPE;
  SPI1->CR1 &= ~SPI_CR1_CPOL;
  SPI1->CR1 |= SPI_CR1_SPE;
}

HAL_StatusTypeDef dac_write(uint8_t reg, uint16_t val) {
  HAL_StatusTypeDef status;

  uint8_t mo[3] = {reg, (val >> 8), val};

  SPI1_Set_CPOL_1();
  HAL_GPIO_WritePin(SPI_NSS_GPIO_Port, SPI_NSS_Pin, GPIO_PIN_RESET);
  status = HAL_SPI_Transmit(&hspi1, mo, 3, 10);
  HAL_GPIO_WritePin(SPI_NSS_GPIO_Port, SPI_NSS_Pin, GPIO_PIN_SET);
  if (status != HAL_OK) {
    printf("fail to write %d %d %d\r\n", mo[0], mo[1], mo[2]);
  }

  return status;
}

HAL_StatusTypeDef dac_read(uint8_t reg, uint16_t *val) {
  HAL_StatusTypeDef status;

  uint8_t mo[3] = {reg | RN_READ, 0x00, 0x00};
  uint8_t mi[3] = {0};

  SPI1_Set_CPOL_1();
  HAL_GPIO_WritePin(SPI_NSS_GPIO_Port, SPI_NSS_Pin, GPIO_PIN_RESET);
  status = HAL_SPI_Transmit(&hspi1, mo, 3, 10);
  HAL_GPIO_WritePin(SPI_NSS_GPIO_Port, SPI_NSS_Pin, GPIO_PIN_SET);
  if (status != HAL_OK) {
    printf("fail to write %d %d %d\r\n", mo[0], mo[1], mo[2]);
    return status;
  }

  SPI1_Set_CPOL_0();
  HAL_GPIO_WritePin(SPI_NSS_GPIO_Port, SPI_NSS_Pin, GPIO_PIN_RESET);
  status = HAL_SPI_Receive(&hspi1, mi, 3, 10);
  HAL_GPIO_WritePin(SPI_NSS_GPIO_Port, SPI_NSS_Pin, GPIO_PIN_SET);
  if (status != HAL_OK) {
    printf("fail to read 0x%02x\r\n", reg);
  }

  if (val) {
    *val = (((uint16_t)mi[1]) << 8) + mi[2];
  }
  return status;
}

/**
 * INTERFACE-CONFIG 7.6.16 INTERFACE-CONFIG Register (address = 26h)
 * [reset = 0000h] p66, enable SDO-EN (bit 0), enable FSDO (bit 2) optional
 *
 * FSDO = 0, 1.25MHz (6.13 Timing Requirements: SPI Read and Daisy Chain
 * Operation (FSDO = 0) FSDO = 1, 2.50MHz (6.14 Timing Requirements: SPI Read
 * and Daisy Chain Operation (FSDO = 1
 */
void dac_enable_sdo() {
  uint16_t val;
  dac_write(RN_INTERFACE_CONFIG, 0x0005);
  dac_read(RN_INTERFACE_CONFIG, &val);

  printf("interface-config: %d\r\n", val);
}

void read_general_status() {
  general_status_t status;

  dac_read(RN_GENERAL_STATUS, &status.val);
  printf("general-status: %u, device-id %u, version-id %u\r\n", status.val,
         status.device_id, status.version_id);
}

const char *iout_range_strs[] = {"-25u to 25u",   "-50u to 50u",
                                 "-125u to 125u", "-250u to 250u",
                                 "invalid",       NULL};

void dump_dac_registers(void) {

  dac_x_iout_misc_config_t iout_misc_config;
  dac_x_cmp_mode_config_t cmp_mode_config;

  dac_x_data_t data;

  common_config_t common_config;

  interface_config_t interface_config;

  unsigned int range, index;

  printf("------- dump-begin --------\r\n");
#if (DUMP_DAC_X_MARGIN == 1)
  dac_x_margin_t margin;
#endif

#if (DUMP_DAC_X_VOUT_CMP_CONFIG == 1)
  dac_x_vout_cmp_config_t vout_cmp_config;
#endif

#if (DUMP_DAC_X_FUNC_CONFIG == 1)
  dac_x_func_config_t func_config;
#endif

  // dac 1
#if (DUMP_DAC_X_MARGIN == 1)
  dac_x_margin_t margin;
  dac_read(RN_DAC_1_MARGIN_HIGH, &margin.val);
  printf("dac-1-margin-high %d\r\n", margin.dac53202.dac_x_margin);

  dac_read(RN_DAC_1_MARGIN_LOW, &margin.val);
  printf("dac-1-margin-low %d\r\n", margin.dac53202.dac_x_margin);
#endif

#if (DUMP_DAC_X_VOUT_CMP_CONFIG == 1)
  dac_read(RN_DAC_1_VOUT_CMP_CONFIG, &vout_cmp_config.val);
  printf("dac-1-vout-cmp-config\r\n");
  printf("  cmp-1-en: %u\r\n", vout_cmp_config.cmp_x_en);
  printf("  cmp-1-inv-en: %u\r\n", vout_cmp_config.cmp_x_inv_en);
  printf("  cmp-1-hiz-in-dis: %u\r\n", vout_cmp_config.cmp_x_hiz_in_dis);
  printf("  cmp-1-out-en: %u", vout_cmp_config.cmp_x_out_en);
  printf("  cmp-1-od-en: %u", vout_cmp_config.cmp_x_od_en);
  printf("  vout-gain-1: %u", vout_cmp_config.vout_gain_x);
#endif

  dac_read(RN_DAC_1_IOUT_MISC_CONFIG, &iout_misc_config.val);
  printf("dac-1-iout-misc-config\r\n");
  range = iout_misc_config.iout_range_x;
  index = (range < 8 || range > 11) ? 4 : range - 8;
  printf("  iout-range-1: %u, %s\r\n", range, iout_range_strs[index]);

  dac_read(RN_DAC_1_CMP_MODE_CONFIG, &cmp_mode_config.val);
  printf("dac-1-cmp-mode-config, cmp-1-mode: %u\r\n",
         cmp_mode_config.cmp_x_mode);

#if (DUMP_DAC_X_FUNC_CONFIG == 1)
  dac_read(RN_DAC_1_FUNC_CONFIG, &func_config.val);
  printf("dac-1-func-config\r\n");
  if (func_config.linear.log_slew_en_x) {
    printf("  fall-slew-1: %u\r\n", func_config.logarithmic.fall_slew_x);
    printf("  rise-slew-1: %u\r\n", func_config.logarithmic.rise_slew_x);
    printf("  log-slew-en-1: %u\r\n", func_config.logarithmic.log_slew_en_x);
    printf("  func-config-1: %u\r\n", func_config.logarithmic.func_config_x);
    printf("  phase-sel-1: %u\r\n", func_config.logarithmic.phase_sel_x);
    printf("  brd-config-1: %u\r\n", func_config.logarithmic.brd_config_x);
    printf("  sync-config-1: %u\r\n", func_config.logarithmic.sync_config_x);
    printf("  clr-sel-1: %u\r\n", func_config.logarithmic.clr_sel_x);
  } else {
    printf("  slew-rate-1: %u\r\n", func_config.linear.slew_rate_x);
    printf("  code-step-1: %u\r\n", func_config.linear.code_step_x);
    printf("  log-slew-en-1: %u\r\n", func_config.linear.log_slew_en_x);
    printf("  func-config-1: %u\r\n", func_config.linear.func_config_x);
    printf("  phase-sel-1: %u\r\n", func_config.linear.phase_sel_x);
    printf("  brd-config-1: %u\r\n", func_config.linear.brd_config_x);
    printf("  sync-config-1: %u\r\n", func_config.linear.sync_config_x);
    printf("  clr-sel-1: %u\r\n", func_config.linear.clr_sel_x);
  }
#endif

  dac_read(RN_DAC_1_DATA, &data.val);
  printf("dac-1-data: %u", data.current.dac_x_data);

