gingerologist/stm32-project-bundle/mx/tong-v3-g431kbu6/Core/Src/sidekick.c
#if (DUMP_DEVICE_MODE_CONFIG == 1)
  device_mode_config_t device_mode_config;
  dac_read(RN_DEVICE_MODE_CONFIG, &device_mode_config.val);
  printf("device-mode-config\r\n");
  printf("  protect-config: %u\r\n", device_mode_config.protect_config);
  printf("  dis-mode-in: %u\r\n", device_mode_config.dis_mode_in);
#endif

  dac_read(RN_INTERFACE_CONFIG, &interface_config.val);
  printf("interface-config, sdo-en: %u, fsdo-en: %u, en-pmbus: %u, timeout-en: "
         "%u\r\n",
         interface_config.sdo_en, interface_config.fsdo_en,
         interface_config.en_pmbus, interface_config.timeout_en);

#if (DUMP_SRAM == 1)
  sram_config_t sram_config;
  sram_data_t sram_data;

  dac_read(RN_SRAM_CONFIG, &sram_config.val);
  printf("sram-config\r\n");
  printf("  sram-addr: %u\r\n", sram_config.sram_addr);

  dac_read(RN_SRAM_DATA, &sram_data.val);
  printf("sram-data\r\n");
  printf("  sram-data: %u\r\n", sram_data.sram_data);
#endif

#if (DUMP_BRDCAST_DATA == 1)
  brdcast_data_t brdcast_data;
  dac_read(RN_BRDCAST_DATA, &brdcast_data.val);
  printf("brdcast-data\r\n");
  printf("  brdcast-data [dac53202] : %u\r\n",
         brdcast_data.dac53202.brdcast_data);
  printf("  brdcast-data [dac63202] : %u\r\n",
         brdcast_data.dac63202.brdcast_data);
#endif

  printf("-------  dump-end  --------\r\n");
}

extern TIM_HandleTypeDef htim2;

static pulse_config_t current_config = {0};
static bool current_config_valid     = false;
static pulse_config_t running_config = {0};
static bool running_config_valid     = false;

static void CLI_CMD_Clear(EmbeddedCli *cli, char *args, void *context) {
  // printf("\033[2J\033[H"); This does not work
  // printf("\x1B[2J\x1B[H"); This does not work either
  HAL_UART_Transmit(&huart1, (uint8_t *)"\x1B[2J\x1B[H", 7,
                    HAL_MAX_DELAY); // this works :)
}

CliCommandBinding cli_cmd_clear_binding = {"clear", "Clear screen.", false,
                                           NULL, CLI_CMD_Clear};

static void CLI_CMD_Reboot(EmbeddedCli *cli, char *args, void *context) {
  NVIC_SystemReset();
}

CliCommandBinding cli_cmd_reboot_binding = {"reboot", "Reboot", false, NULL,
                                            CLI_CMD_Reboot};

static int parse_max5_digits(const char *str) {
  if (str == NULL)
    return -1;

  int len = strlen(str);
  if (len == 0 || len > 5)
    return -1;

  if (len > 1 && str[0] == '0')
    return -1;

  int sum = 0;
  for (int i = 0; i < len; i++) {
    if (str[i] < '0' || str[i] > '9') {
      return -1;
    }
    sum = sum * 10 + (str[i] - '0');
  }

  return sum;
}

static void print_config(const char *name, bool *valid,
                         pulse_config_t *config) {
  if (!(*valid)) {
    printf("no %s config\r\n", name);
    return;
  }

  printf("%s config\r\n", name);
  printf("  current: %u steps\r\n", config->current);
  printf("    width: %u us\r\n", config->width);
  printf("   period: %u ms\r\n", config->period);
}

// set <current> <pulse width> <period>
static void CLI_CMD_Set(EmbeddedCli *cli, char *args, void *context) {
  int current, width, period;

  uint16_t count = embeddedCliGetTokenCount(args);
  if (count != 3) {
    printf("count %u\r\n", count);
    return;
  }

  // current
  current = parse_max5_digits(embeddedCliGetToken(args, 1));
  if (current < 1 || current > 128) {
    printf("invalid current\r\n");
    return;
  }

  width = parse_max5_digits(embeddedCliGetToken(args, 2));
  if (width < 100 || width > 1000) {
    printf("invalid width\r\n");
    return;
  }

  period = parse_max5_digits(embeddedCliGetToken(args, 3));
  if (period < 50 || period > 500) {
    printf("invalid period\r\n");
    return;
  }

  current_config.current = current;
  current_config.width   = width;
  current_config.period  = period;
  current_config_valid   = true;
}

CliCommandBinding cli_cmd_set_binding = {
    "set",
    "set pulse parameters\r\n"
    "        set <current:1-128 steps> <pulse width: 100-1000 micro-seconds> "
    "<period: 50-500 milli-seconds>\r\n"
    "        example: set 64 200 100",
    true, NULL, CLI_CMD_Set};

static void CLI_CMD_Show(EmbeddedCli *cli, char *args, void *context) {
  bool saved_config_valid;
  pulse_config_t saved_config;

  print_config("current", &current_config_valid, &current_config);
  print_config("running", &running_config_valid, &running_config);

  saved_config_valid = load_config(&saved_config, false);
  print_config("saved", &saved_config_valid, &saved_config);
}

CliCommandBinding cli_cmd_show_binding = {"show", "show config and simulation",
                                          false, NULL, CLI_CMD_Show};

static void start_stimulation(void) {
  if (!current_config_valid) {
    printf("no config\r\n");
    return;
  }

  pulse_config_t *pcfg;

  xQueueReceive(configIdleQueueHandle, &pcfg, portMAX_DELAY);

  pcfg->current        = current_config.current;
  pcfg->width          = current_config.width;
  pcfg->period         = current_config.period;
  running_config       = current_config;
  running_config_valid = true;

  xQueueSend(configPendingQueueHandle, &pcfg, portMAX_DELAY);
  printf("stimulation started\r\n");
}

static void CLI_CMD_Start(EmbeddedCli *cli, char *args, void *context) {
  start_stimulation();
}

CliCommandBinding cli_cmd_start_binding = {"start", "start stimulation", false,
                                           NULL, CLI_CMD_Start};

static void CLI_CMD_Stop(EmbeddedCli *cli, char *args, void *context) {
  uint32_t *p = NULL;
  xQueueSend(configPendingQueueHandle, &p, portMAX_DELAY);
  running_config_valid = false;
}

CliCommandBinding cli_cmd_stop_binding = {"stop", "stop simulation", false,
                                          NULL, CLI_CMD_Stop};

static void CLI_CMD_Save(EmbeddedCli *cli, char *args, void *context) {
  if (!current_config_valid) {
    printf("no config\r\n");
    return;
  }
  save_config(&current_config);
}

CliCommandBinding cli_cmd_save_binding = {
    "save",
    "save config to flash and start stimulation automatically after power up",
    false, NULL, CLI_CMD_Save};

static void CLI_CMD_Delete(EmbeddedCli *cli, char *args, void *context) {
  delete_config();
}

CliCommandBinding cli_cmd_delete_binding = {"delete", "delete saved config",
                                            false, NULL, CLI_CMD_Delete};

void StartDefaultTask(void const *argument) {
  cli_config     = embeddedCliDefaultConfig();
  cli            = embeddedCliNew(cli_config);
  cli->writeChar = cli_writeChar;

