gingerologist/stm32-project-bundle/mx/tong-v3-g431kbu6/Core/Src/sidekick.c
  embeddedCliAddBinding(cli, cli_cmd_clear_binding);
  embeddedCliAddBinding(cli, cli_cmd_reboot_binding);
  embeddedCliAddBinding(cli, cli_cmd_set_binding);
  embeddedCliAddBinding(cli, cli_cmd_show_binding);
  embeddedCliAddBinding(cli, cli_cmd_start_binding);
  embeddedCliAddBinding(cli, cli_cmd_stop_binding);
  embeddedCliAddBinding(cli, cli_cmd_save_binding);
  embeddedCliAddBinding(cli, cli_cmd_delete_binding);

  embeddedCliReceiveChar(cli, 9);
  embeddedCliProcess(cli);

  if (load_config(&current_config, true)) {
    current_config_valid = true;
    start_stimulation();
  }

  /* Infinite loop */
  for (;;) {
    uint8_t c;
    HAL_StatusTypeDef status = HAL_UART_Receive(&huart1, &c, 1, 10);
    if (status == HAL_OK) {
      embeddedCliReceiveChar(cli, c);
      embeddedCliProcess(cli);
      continue;
    }

    vTaskDelay(pdMS_TO_TICKS(30));
  }
}

/**
 * To enter current-output mode for each DAC channel, disable the respective
 * IOUT-PDN-X bits in the COMMONCONFIG register, and set the respective
 * VOUT-PDN-X bits in the same register to Hi-Z power-down mode. Select the
 * desired current-output range by writing to the IOUT-RANGE-X bit in the
 * DAC-X-IOUT-MISC-CONFIG register. To minimize leakage in current-output mode,
 * disconnect the FBx pin. For the best power-on glitch performance, program the
 * NVM with IOUT mode using the smallest output range before powering on the
 * output channel, and then immediately program the DAC code and desired output
 * range. The transfer function of the output current is shown in formula 4.
 */
static void init_current_sink(void) {
  common_config_t common_config = {
      .iout_pdn_1   = 1, // power down iout1
      .vout_pdn_1   = 3, // power down vout1 with Hi-Z to AGND
      .iout_pdn_0   = 1, // power down iout0
      .vout_pdn_0   = 3, // power down vout0 with Hi-Z to AGND
      .en_int_ref   = 1, // enable internal reference.
      .ee_read_addr = 0, // irrelevant
      .dev_lock     = 0, // irrelevant
      .win_latch_en = 0, // irrelevant
  };
  dac_write(RN_COMMON_CONFIG, common_config.val);

  dac_x_iout_misc_config_t iout_misc_config = {
      .iout_range_x = 10,
  };
  dac_write(RN_DAC_0_IOUT_MISC_CONFIG, iout_misc_config.val);
  dac_write(RN_DAC_1_IOUT_MISC_CONFIG, iout_misc_config.val);
}

/**
 * original equation
 *
 * Iout = DAC_DATA * 250u / 256 - 125u
 * when DAC_DATA = 0,   Iout = -125u
 * when DAC_DATA = 64,  Iout = -62.5u
 * when DAC_DATA = 128, Iout = 0u
 *
 * step is defined as 128 - DAC_DATA
 */
static void start_current_sink(uint8_t step) {
  if (step > 128)
    step = 128;

  common_config_t common_config = {
      .iout_pdn_1   = 0, // power on iout1
      .vout_pdn_1   = 3, // power down vout1 with Hi-Z to AGND
      .iout_pdn_0   = 0, // power on iout0
      .vout_pdn_0   = 3, // power down vout0 with Hi-Z to AGND
      .en_int_ref   = 1, // enable internal reference.
      .ee_read_addr = 0, // irrelevant
      .dev_lock     = 0, // irrelevant
      .win_latch_en = 0, // irrelevant
  };
  dac_write(RN_COMMON_CONFIG, common_config.val);

  dac_x_data_t dac_data = {.current = {.dac_x_data = 128 - step}};
  dac_write(RN_DAC_0_DATA, dac_data.val);
  dac_write(RN_DAC_1_DATA, dac_data.val);
}

static void stop_current_sink() {
  common_config_t common_config = {
      .iout_pdn_1   = 1, // power down iout1
      .vout_pdn_1   = 3, // power down vout1 with Hi-Z to AGND
      .iout_pdn_0   = 1, // power down iout0
      .vout_pdn_0   = 3, // power down vout0 with Hi-Z to AGND
      .en_int_ref   = 1, // enable internal reference.
      .ee_read_addr = 0, // irrelevant
      .dev_lock     = 0, // irrelevant
      .win_latch_en = 0, // irrelevant
  };
  dac_write(RN_COMMON_CONFIG, common_config.val);
}

// active low
static void start_opamp() {
  HAL_GPIO_WritePin(CH0_SD_GPIO_Port, CH0_SD_Pin, GPIO_PIN_RESET);
  HAL_GPIO_WritePin(CH1_SD_GPIO_Port, CH1_SD_Pin, GPIO_PIN_RESET);
}

static void stop_opamp() {
  HAL_GPIO_WritePin(CH0_SD_GPIO_Port, CH0_SD_Pin, GPIO_PIN_SET);
  HAL_GPIO_WritePin(CH1_SD_GPIO_Port, CH1_SD_Pin, GPIO_PIN_SET);
}

// active high
static void switch_sourcing(void) {
  HAL_GPIO_WritePin(MUX_SEL1_GPIO_Port, MUX_SEL1_Pin, GPIO_PIN_SET);
  HAL_GPIO_WritePin(MUX_SEL2_GPIO_Port, MUX_SEL2_Pin, GPIO_PIN_SET);
  HAL_GPIO_WritePin(MUX_SEL3_GPIO_Port, MUX_SEL3_Pin, GPIO_PIN_SET);
  HAL_GPIO_WritePin(MUX_SEL4_GPIO_Port, MUX_SEL4_Pin, GPIO_PIN_SET);
}

static void switch_sinking(void) {
  HAL_GPIO_WritePin(MUX_SEL1_GPIO_Port, MUX_SEL1_Pin, GPIO_PIN_RESET);
  HAL_GPIO_WritePin(MUX_SEL2_GPIO_Port, MUX_SEL2_Pin, GPIO_PIN_RESET);
  HAL_GPIO_WritePin(MUX_SEL3_GPIO_Port, MUX_SEL3_Pin, GPIO_PIN_RESET);
  HAL_GPIO_WritePin(MUX_SEL4_GPIO_Port, MUX_SEL4_Pin, GPIO_PIN_RESET);
}

// Active low logic enable; has internal pull-down resistor. The SELx logic
// inputs determine switch connections when this pin is low (see 节 7.5)
static void switch_on(void) {
  HAL_GPIO_WritePin(MUX_EN_GPIO_Port, MUX_EN_Pin, GPIO_PIN_RESET);
}

static void switch_off(void) {
  HAL_GPIO_WritePin(MUX_EN_GPIO_Port, MUX_EN_Pin, GPIO_PIN_SET);
}

static void bleed_on(void) {
  HAL_GPIO_WritePin(BLEED_EN_GPIO_Port, BLEED_EN_Pin, GPIO_PIN_RESET);
}

static void bleed_off(void) {
  HAL_GPIO_WritePin(BLEED_EN_GPIO_Port, BLEED_EN_Pin, GPIO_PIN_SET);
}

static void start_timer() {
  __HAL_TIM_SET_AUTORELOAD(&htim2, 0xffffffff);
  HAL_TIM_Base_Start(&htim2);
}

static void stop_timer() { HAL_TIM_Base_Stop(&htim2); }

static inline uint32_t tim_counter() { return __HAL_TIM_GET_COUNTER(&htim2); }

static void tim_delay_us(unsigned int us) {
  uint32_t mark = tim_counter();
  while (htim2.State == HAL_TIM_STATE_BUSY && tim_counter() - mark < us)
    ;
}

static void enable_hv_power(void) {
  HAL_GPIO_WritePin(EN_POS_HV_GPIO_Port, EN_POS_HV_Pin, GPIO_PIN_SET);
  HAL_GPIO_WritePin(EN_NEG_HV_GPIO_Port, EN_NEG_HV_Pin, GPIO_PIN_SET);
}

static void disable_hv_power(void) {
  HAL_GPIO_WritePin(EN_POS_HV_GPIO_Port, EN_POS_HV_Pin, GPIO_PIN_RESET);
  HAL_GPIO_WritePin(EN_NEG_HV_GPIO_Port, EN_NEG_HV_Pin, GPIO_PIN_RESET);
}

