gingerologist/stm32-project-bundle/mx/tong-v3-g431kbu6/Core/Src/sidekick.c
// __HAL_TIM_SET_AUTORELOAD(&htim2, 1999);
// HAL_TIM_Base_Start_IT(&htim2);

const uint8_t steps[4] = {0, 32, 64, 96};

static void do_pulse(unsigned int width, bool print) {
  // static int roll = 0;

  //  dac_x_data_t dac_data = {.current = {.dac_x_data = steps[roll]}};
  //  dac_write(RN_DAC_0_DATA, dac_data.val);
  //  dac_write(RN_DAC_1_DATA, dac_data.val);
  //
  //  roll = (roll + 1) & 0x03;

  uint32_t timestamps[6];

  timestamps[0] = tim_counter();
  start_opamp();
  tim_delay_us(250);
  timestamps[1] = tim_counter();

  switch_sourcing();
  switch_on();
  tim_delay_us(width);
  timestamps[2] = tim_counter();

  switch_off();
  switch_sinking();
  tim_delay_us(10);
  timestamps[3] = tim_counter();

  switch_on();
  tim_delay_us(width);
  timestamps[4] = tim_counter();

  switch_off();
  stop_opamp();

  tim_delay_us(1);

  bleed_on();
  tim_delay_us(10);
  bleed_off();

  timestamps[5] = tim_counter();

  if (print) {
    printf("pulse timing: \r\n");
    for (int i = 1; i < 6; i++) {
      printf("  %lu\r\n", timestamps[i] - timestamps[i - 1]);
    }
  }
}

typedef enum {
  SWTST_ALL_OFF,
  SWTST_SOURCING,
  SWTST_SINKING
} switch_test_case_t;

void switch_test(switch_test_case_t test) {
  switch_off();

  switch (test) {
  case SWTST_ALL_OFF:
    break;
  case SWTST_SOURCING:
    switch_sourcing();
    switch_on();
    break;
  case SWTST_SINKING:
    switch_sinking();
    switch_on();
    break;
  }
}

void StartPulseTask(void const *argument) {
  for (int i = 0; i < 2; i++) {
    pulse_config_t *p = &pulse_config[i];
    xQueueSend(configIdleQueueHandle, &p, portMAX_DELAY);
  }

  TickType_t ticks_to_wait = portMAX_DELAY;
  pulse_config_t config    = {.width = 500};

  enable_hv_power();

  dac_enable_sdo();
  dump_dac_registers();

  printf("\r\n\r\n"
         "start pulse task\r\n");

#if 0
  switch_test(SWTST_ALL_OFF);
  vTaskDelay(portMAX_DELAY);
#endif

  init_current_sink();

  for (;;) {
    pulse_config_t *pcfg;
    if (pdPASS ==
        xQueueReceive(configPendingQueueHandle, &pcfg, ticks_to_wait)) {

      if (pcfg == NULL) {
        // if NULL, stop
        stop_current_sink();
        stop_timer();
        ticks_to_wait = portMAX_DELAY;
      } else {
        config        = *pcfg;
        ticks_to_wait = config.period;
        start_timer();
        start_current_sink(config.current);
        xQueueSend(configIdleQueueHandle, &pcfg, portMAX_DELAY);
      }

      continue;
    } else {
      do_pulse(config.width, false);
    }
  }
}
